app/views/notify.xml

<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope">
	<soapenv:Header />
	<soapenv:Body>
		<b:Notify xmlns:b="http://docs.oasis-open.org/wsn/b-2"
			xmlns:add="http://www.w3.org/2005/08/addressing">
			<b:NotificationMessage>
				<b:SubscriptionReference>
					<add:Address>http://localhost:8878/petals/services/NotificationConsumerPortService</add:Address>
				</b:SubscriptionReference>
				<b:Topic Dialect="?" xmlns:dsb="http://www.petalslink.org/dsb/topicsns/">dsb:DSBTopic</b:Topic>
				<!-- 
				<b:ProducerReference>
					<add:Address>http://localhost:8084/petals/services/NotificationProducerPortService</add:Address>
				</b:ProducerReference>
				-->
				<b:Message>
					<foo>This message is sent to the Web client</foo>
				</b:Message>
			</b:NotificationMessage>
		</b:Notify>
	</soapenv:Body>
</soapenv:Envelope>
